const chapter2 = {
    id: 2,
    name: "Периодтық Кесте және Элементтердің Қасиеттері",
    heading: {
        title: "Периодтық Кесте және Элементтердің Қасиеттері",
        text: "Элементтердің физикалық және химиялық қасиеттерін үйреніп, периодтық кестенің құрылымын түсініңіз. Олардың қалай жіктелгенін және элементтер арасындағы байланысты зерделеңіз."
    },
    modelViewer: {
        src: "https://www.ptable.com/",
        width: "100%",
        height: "600",
        title: "Interactive Periodic Table"
    },
    textContent: {
        title: "Периодтық Кестенің Қасиеттері",
        text: "Периодтық кесте элементтердің атомдық нөміріне байланысты реттелген. Бұл кестеде элементтер металдар, металлоидтар және аметалдар болып үш топқа бөлінеді. Металдар электр өткізгіштігі және жылу өткізгіштігі жоғары болса, аметалдар бұл қасиеттерге ие емес. Металлоидтар бұл екі топтың аралығында жатады, олардың кейбір қасиеттері металдарға, ал кейбіреулері аметалдарға ұқсас."
    },
    quizData: [
        {
            "question": "Периодтық кестедегі элементтердің ең басты сипаттамасы қандай?",
            "options": ["Атомдық массасы", "Атомдық нөмірі", "Изотоптары", "Атомдық радиусы"],
            "correctAnswer": "Атомдық нөмірі"
        },
        {
            "question": "Металдар периодтық кестеде қай жағында орналасқан?",
            "options": ["Сол жақта", "Оң жақта", "Ортасында", "Жоғарғы жағында"],
            "correctAnswer": "Сол жақта"
        },
        {
            "question": "Қандай элемент газ күйінде болады және жиі кездеседі?",
            "options": ["Көміртек", "Азот", "Сутегі", "Хлор"],
            "correctAnswer": "Азот"
        },
        {
            "question": "Периодтық кестеде дәлелденген ең ауыр элемент қайсы?",
            "options": ["Уран", "Плутоний", "Оганесон", "Литий"],
            "correctAnswer": "Оганесон"
        },
        {
            "question": "Аметалдардың қайсысы электронды беруге бейім емес?",
            "options": ["Фтор", "Бром", "Йод", "Неон"],
            "correctAnswer": "Неон"
        }
    ]
    
};

const chapter3 = 
    {
        "id": 3,
        "name": "Иондық Байланыс",
        "heading": {
            "title": "Иондық Байланыс",
            "text": "Иондық байланыс элементтер арасындағы күшті әрі берік химиялық байланыс түрі. Бұл байланыс метал және аметал арасында орналасқан, мұнда электрондар металдан аметалға толық беріледі."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/build-an-atom/latest/build-an-atom_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Ionic Bonding Model"
        },
        "textContent": {
            "title": "Иондық байланыс туралы түсінік",
            "text": "Иондық байланыс - бұл электрондардың бір элементтен екіншісіне толық берілуі арқылы қалыптасады. Бұл процесс металдың иондары оң заряд алады және аметалдың иондары теріс заряд алады. Нәтижесінде қарсы зарядталған иондар арасында электростатикалық тартылыс пайда болады, бұл заттардың қатты және мөлдір қасиеттеріне әкеледі."
        },
        "quizData": [
            {
                "question": "Иондық байланыс неден пайда болады?",
                "options": ["Протондардың бөлісуі", "Электрондардың толық берілуі", "Нейтрондардың қозғалысы", "Иондардың бөлінуі"],
                "correctAnswer": "Электрондардың толық берілуі"
            },
            {
                "question": "Иондық байланыс қалыптастырғанда, металдар не істейді?",
                "options": ["Электрон алады", "Электрон береді", "Протон алады", "Нейтрон береді"],
                "correctAnswer": "Электрон береді"
            },
            {
                "question": "Келесі элементтердің қайсысы ең бейім иондық байланыс жасайды?",
                "options": ["Көміртек", "Натрий", "Фосфор", "Сутегі"],
                "correctAnswer": "Натрий"
            },
            {
                "question": "Иондық байланыс әдетте қандай температурада берік?",
                "options": ["Төмен температурада", "Жоғары температурада", "Орташа температурада", "Температураның әсері жоқ"],
                "correctAnswer": "Жоғары температурада"
            },
            {
                "question": "Иондық байланыс болған заттардың ерекшелігі неде?",
                "options": ["Жұмсақ және иілгіш", "Қатты және мөлдір", "Балқу температурасы төмен", "Электр өткізгіштігі жоғары"],
                "correctAnswer": "Қатты және мөлдір"
            }
        ]
    }
    

    const chapter4 = {
        "id": 4,
        "name": "Ковалентті Байланыс",
        "heading": {
            "title": "Ковалентті Байланыс",
            "text": "Ковалентті байланыс - бұл бір немесе одан да көп электрондардың екі атом арасында бөлісілуі арқылы қалыптасатын химиялық байланыс. Бұл байланыс аметалдар арасында кеңінен таралған."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/molecule-shapes/latest/molecule-shapes_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Covalent Bonding Model"
        },
        "textContent": {
            "title": "Ковалентті Байланыс Негіздері",
            "text": "Ковалентті байланыс қалыптасқанда, атомдар өздерінің сыртқы электрондарын бөліседі, бұл оларды біріктіретін ортақ электрондық жұптарды түзеді. Бұл түрдегі байланыс молекулалардың тұрақты құрылымын қамтамасыз етеді және көбінесе біркелкі эмес электрондық бөлуішілікті қамтиды."
        },
        "quizData": [
            {
                "question": "Ковалентті байланыс қалай қалыптасады?",
                "options": ["Электрондардың толық берілуі", "Электрондардың бөлісілуі", "Иондардың қозғалысы", "Протондардың алмасуы"],
                "correctAnswer": "Электрондардың бөлісілуі"
            },
            {
                "question": "Ковалентті байланыстың ерекшелігі неде?",
                "options": ["Қатты және мөлдір", "Жұмсақ және иілгіш", "Электр өткізгіштігі жоғары", "Жоғары температурада берік"],
                "correctAnswer": "Жұмсақ және иілгіш"
            },
            {
                "question": "Қандай молекула ковалентті байланыспен құрылады?",
                "options": ["NaCl", "H2O", "NaOH", "CaO"],
                "correctAnswer": "H2O"
            },
            {
                "question": "Ковалентті байланыстағы атомдар не істейді?",
                "options": ["Электрондарды береді", "Электрондарды қабылдайды", "Электрондарды бөліседі", "Протондарды алмасады"],
                "correctAnswer": "Электрондарды бөліседі"
            },
            {
                "question": "Ковалентті байланыс қалыптасқанда неше тұрақтылық күшейеді?",
                "options": ["Иондық тұрақтылық", "Молекулалық тұрақтылық", "Химиялық тұрақтылық", "Атомдық тұрақтылық"],
                "correctAnswer": "Молекулалық тұрақтылық"
            }
        ]
    }

    const chapter5 = {
        "id": 5,
        "name": "Металдық Байланыс",
        "heading": {
            "title": "Металдық Байланыс",
            "text": "Металдық байланыс - бұл металл атомдарының ортақ электрон бұлтын құру арқылы өзара байланысқан күйі. Бұл байланыс түрі металлдардың өзгеше қасиеттерін түсіндіруді қамтамасыз етеді, мысалы, жоғары электр және жылу өткізгіштігі."
        },
       "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/build-an-atom/latest/build-an-atom_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Build an Atom Simulation"
        },
        "textContent": {
            "title": "Металдық Байланысқа Шолу",
            "text": "Металл атомдарының электрондары 'электрон деңгейінде' бос жүреді, бұл олардың жылжымалы болуына және металдық байланыстың қалыптасуына мүмкіндік береді. Электрондардың бұл ортақ пайдалануы металдардың үздіксіз кристалдық құрылымына әкеледі."
        },
        "quizData": [
            {
                "question": "Металдық байланыс неден құралады?",
                "options": ["Электрондардың толық берілуі", "Электрондардың бөлісілуі", "Бос жүретін электрондар", "Протондардың алмасуы"],
                "correctAnswer": "Бос жүретін электрондар"
            },
            {
                "question": "Металдардың жоғары электр өткізгіштігінің себебі неде?",
                "options": ["Протондардың көптігі", "Электрондардың жоғары мобильдігі", "Нейтрондардың стабильдігі", "Иондардың стабильдігі"],
                "correctAnswer": "Электрондардың жоғары мобильдігі"
            },
            {
                "question": "Қандай металл молекулалардың арасындағы металдық байланыстар ең берік?",
                "options": ["Алтын", "Күміс", "Темір", "Свинец"],
                "correctAnswer": "Темір"
            },
            {
                "question": "Металдық байланыс қандай қасиетке әкеледі?",
                "options": ["Балқымаға қарсылық", "Қаттылық", "Магнетизм", "Дуктильдік"],
                "correctAnswer": "Дуктильдік"
            },
            {
                "question": "Металл кристалдарының құрылымы қалай аталады?",
                "options": ["Базалық кристалдық құрылым", "Молекулалық құрылым", "Аморфты құрылым", "Центрленген куб"],
                "correctAnswer": "Центрленген куб"
            }
        ]
    }
    
    const chapter6 = {
        "id": 6,
        "name": "Молекулалық Геометрия және VSEPR Теориясы",
        "heading": {
            "title": "Молекулалық Геометрия және VSEPR Теориясы",
            "text": "Молекулалық геометрия және VSEPR теориясы молекулалардың құрылымдық пішіндерін түсіндіруді мақсат етеді. Бұл теория молекулалардың электрондық жұптарының орналасуына байланысты болып, олардың геометриялық конфигурацияларын анықтайды."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/molecule-shapes/latest/molecule-shapes_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Molecule Shapes Simulation"
        },
        "textContent": {
            "title": "VSEPR Теориясының Негіздері",
            "text": "VSEPR теориясы молекулалық геометрияның қалай анықталатынын, оның ішінде молекулалардың атомдары мен электрондық жұптардың арасындағы тартылыс күштерін қалай ықпал ететінін түсіндіреді. Бұл молекуланың беріктігіне, құрылымына және химиялық реакцияға бейімділігіне әсер етеді."
        },
        "quizData": [
            {
                "question": "VSEPR теориясы молекулалық құрылымды қалай анықтайды?",
                "options": ["Атомдардың салмағы бойынша", "Электрондық жұптардың орналасуы бойынша", "Протондардың саны бойынша", "Иондық байланыстардың күші бойынша"],
                "correctAnswer": "Электрондық жұптардың орналасуы бойынша"
            },
            {
                "question": "Қандай молекула геометриясы тетраэдрик?",
                "options": ["H2O", "CO2", "CH4", "NaCl"],
                "correctAnswer": "CH4"
            },
            {
                "question": "Молекулалық геометрия неліктен маңызды?",
                "options": ["Молекуланың түсін анықтау үшін", "Химиялық реакциялардың жылдамдығын болжау үшін", "Молекуланың физикалық және химиялық қасиеттерін анықтау үшін", "Атомдардың массасын анықтау үшін"],
                "correctAnswer": "Молекуланың физикалық және химиялық қасиеттерін анықтау үшін"
            },
            {
                "question": "VSEPR теориясы қандай болжам жасайды?",
                "options": ["Молекулалардың көлемі", "Молекулалардың балқу нүктесі", "Молекулалардың геометриясы", "Молекулалардың ауырлық күші"],
                "correctAnswer": "Молекулалардың геометриясы"
            },
            {
                "question": "Электрондық жұптың орналасуының молекулаға әсері қандай?",
                "options": ["Түсін өзгертеді", "Агрегаттық күйін өзгертеді", "Молекулалық геометрияны анықтайды", "Молекулалық массаны өзгертеді"],
                "correctAnswer": "Молекулалық геометрияны анықтайды"
            }
        ]
    }

    const chapter7 = {
        "id": 7,
        "name": "Аралық Молекулалық Күштер",
        "heading": {
            "title": "Аралық Молекулалық Күштер",
            "text": "Аралық молекулалық күштер молекулалар арасындағы байланыс күштерін қамтиды және заттардың физикалық қасиеттерін анықтауға маңызды әсер етеді. Бұл күштер Ван-дер-Ваальс күштері, диполь-диполь әсерлері және водород байланыстарын қамтиды."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/states-of-matter/latest/states-of-matter_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive States of Matter Simulation"
        },
        "textContent": {
            "title": "Аралық Молекулалық Күштердің Рөлі",
            "text": "Аралық молекулалық күштер молекулалардың физикалық қасиеттеріне, олардың балқу нүктесіне, қайнау нүктесіне және ерігіштігіне өзгеріс енгізеді. Мысалы, водород байланыстарының бар болуы судың қайнау температурасын жоғарылатады."
        },
        "quizData": [
            {
                "question": "Ван-дер-Ваальс күштері неде қолданылады?",
                "options": ["Иондық байланыстарда", "Ковалентті байланыстарда", "Аралық молекулалық күштерде", "Металдық байланыстарда"],
                "correctAnswer": "Аралық молекулалық күштерде"
            },
            {
                "question": "Аралық молекулалық күштердің әсері неде көрінеді?",
                "options": ["Атомдардың ядросының структурасында", "Молекулалардың қозғалысында", "Заттардың агрегаттық күйінде", "Электрондардың орбитасында"],
                "correctAnswer": "Заттардың агрегаттық күйінде"
            },
            {
                "question": "Қандай молекула Ван-дер-Ваальс күштеріне көп әсер етеді?",
                "options": ["Суда", "Көміртекте", "Азотта", "Оксигенде"],
                "correctAnswer": "Көміртекте"
            },
            {
                "question": "Водород байланыстары не үшін маңызды?",
                "options": ["Электронды беру үшін", "Протонды алмасу үшін", "Молекулалардың тұрақтылығын арттыру үшін", "Иондардың реактивтілігін төмендету үшін"],
                "correctAnswer": "Молекулалардың тұрақтылығын арттыру үшін"
            },
            {
                "question": "Диполь-диполь әсерлері қайда кездеседі?",
                "options": ["Металлдарда", "Аметалларда", "Полярлы молекулаларда", "Неполярлы молекулаларда"],
                "correctAnswer": "Полярлы молекулаларда"
            }
        ]
    }
    
    
    const chapter8 = {
        "id": 8,
        "name": "Химиялық Реакциялар және Теңдеулер",
        "heading": {
            "title": "Химиялық Реакциялар және Теңдеулер",
            "text": "Бұл бөлім химиялық реакциялардың түрлері мен химиялық теңдеулерді қалай дұрыс теңестіруге болатынын қамтиды."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/balancing-chemical-equations/latest/balancing-chemical-equations_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Balancing Chemical Equations Simulation"
        },
        "textContent": {
            "title": "Химиялық Реакциялар",
            "text": "Химиялық реакциялар заттардың қасиеттерін өзгертеді және жаңа заттардың пайда болуына әкеледі. Бұл процестер теңдеулер арқылы көрсетіледі, мұнда реагенттер мен өнімдер дұрыс мөлшерде болуы тиіс."
        },
        "quizData": [
            {
                "question": "Химиялық реакцияны теңестірудің маңызы неде?",
                "options": ["Зат массасының сақталуын қамтамасыз ету", "Реакцияның жылдамдығын арттыру", "Реакцияның жылуын азайту", "Катализатордың тиімділігін арттыру"],
                "correctAnswer": "Зат массасының сақталуын қамтамасыз ету"
            },
            {
                "question": "Экзотермиялық реакция дегеніміз не?",
                "options": ["Жылу шығаратын реакция", "Жылу сіңіретін реакция", "Жарық шығаратын реакция", "Электр шығаратын реакция"],
                "correctAnswer": "Жылу шығаратын реакция"
            },
            {
                "question": "Химиялық реакцияның жалпы түрі қалай аталады?",
                "options": ["Комбинация реакциясы", "Тотығу реакциясы", "Ыдырау реакциясы", "Тепе-тең реакция"],
                "correctAnswer": "Тепе-тең реакция"
            }
        ]
    }

    const chapter9 = {
        "id": 9,
        "name": "Заттардың Күйлері және Өзгерістер",
        "heading": {
            "title": "Заттардың Күйлері және Өзгерістер",
            "text": "Бұл бөлім заттардың қатты, сұйық және газ күйлерін, сондай-ақ осы күйлер арасындағы өзгерістерді қарастырады."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/states-of-matter-basics/latest/states-of-matter-basics_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive States of Matter: Basics Simulation"
        },
        "textContent": {
            "title": "Материяның Өзгерістері",
            "text": "Материя үш негізгі күйде болады: қатты, сұйық және газ. Бұл күйлер арасындағы өзгерістер физикалық және химиялық процестер арқылы жүреді, мысалы, балқу, булану, және конденсация."
        },
        "quizData": [
            {
                "question": "Сублимация дегеніміз не?",
                "options": ["Қаттыдан тікелей газға айналу", "Сұйықтан газға айналу", "Газдан сұйыққа айналу", "Сұйықтан қаттыға айналу"],
                "correctAnswer": "Қаттыдан тікелей газға айналу"
            },
            {
                "question": "Депозиция дегеніміз не?",
                "options": ["Қаттыдан тікелей газға айналу", "Сұйықтан газға айналу", "Газдан тікелей қаттыға айналу", "Сұйықтан қаттыға айналу"],
                "correctAnswer": "Газдан тікелей қаттыға айналу"
            },
            {
                "question": "Заттардың қай күйі молекулалардың ең аз байланысқан күйі болып табылады?",
                "options": ["Қатты", "Сұйық", "Газ", "Плазма"],
                "correctAnswer": "Газ"
            }
        ]
    }
    
    const chapter10 = {
        "id": 10,
        "name": "Ерітінділер және Ерігіштік",
        "heading": {
            "title": "Ерітінділер және Ерігіштік",
            "text": "Бұл бөлім ерітінділер және олардың ерігіштік қасиеттері туралы ақпаратты қамтиды, сондай-ақ заттардың сұйық ортада қалай еритіндігін зерттейді."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/states-of-matter/latest/states-of-matter_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive States of Matter Simulation"
        },
        "textContent": {
            "title": "Ерітінділер мен Ерігіштік",
            "text": "Ерігіштік - бұл белгілі бір температурада сұйықтықта ерітін зат мөлшерінің өлшемі. Ерігіштік заттың химиялық қасиеттеріне, температураға және ерігіштігіне байланысты өзгереді."
        },
        "quizData": [
            {
                "question": "Суда ең жақсы еритін зат қайсы?",
                "options": ["Қант", "Тұз", "Желатин", "Алмаз"],
                "correctAnswer": "Қант"
            },
            {
                "question": "Ерігіштіктің жоғарылауына әсер ететін фактор қайсы?",
                "options": ["Температураның төмендеуі", "Қысымның төмендеуі", "Температураның жоғарылауы", "Қысымның жоғарылауы"],
                "correctAnswer": "Температураның жоғарылауы"
            },
            {
                "question": "Ерігіштік диаграммасы не үшін қолданылады?",
                "options": ["Заттардың тығыздығын анықтау", "Еріген зат мөлшерін анықтау", "Заттардың көлемін анықтау", "Еріген заттың массасын анықтау"],
                "correctAnswer": "Еріген зат мөлшерін анықтау"
            }
        ]
    }
    
    
    const chapters = [
        null,
        chapter2,
        chapter3,
        chapter4,
        chapter5,
        chapter6,
        chapter7,
        chapter8,
        chapter9,
        chapter10
    ]
    
export {
    chapters
}