const chapter2 = {
    id: 2,
    name: "Периодтық Кесте және Элементтердің Қасиеттері",
    heading: {
        title: "Периодтық Кесте және Элементтердің Қасиеттері",
        text: "Элементтердің физикалық және химиялық қасиеттерін үйреніп, периодтық кестенің құрылымын түсініңіз. Олардың қалай жіктелгенін және элементтер арасындағы байланысты зерделеңіз."
    },
    modelViewer: {
        src: "https://www.ptable.com/",
        width: "100%",
        height: "600",
        title: "Interactive Periodic Table"
    },
    textContent: {
        title: "Периодтық Кестенің Қасиеттері",
        text: "Периодтық кесте элементтердің атомдық нөміріне байланысты реттелген. Бұл кестеде элементтер металдар, металлоидтар және аметалдар болып үш топқа бөлінеді. Металдар электр өткізгіштігі және жылу өткізгіштігі жоғары болса, аметалдар бұл қасиеттерге ие емес. Металлоидтар бұл екі топтың аралығында жатады, олардың кейбір қасиеттері металдарға, ал кейбіреулері аметалдарға ұқсас."
    },
    quizData: [
        {
            "question": "Периодтық кестедегі элементтердің ең басты сипаттамасы қандай?",
            "options": ["Атомдық массасы", "Атомдық нөмірі", "Изотоптары", "Атомдық радиусы"],
            "correctAnswer": "Атомдық нөмірі"
        },
        {
            "question": "Металдар периодтық кестеде қай жағында орналасқан?",
            "options": ["Сол жақта", "Оң жақта", "Ортасында", "Жоғарғы жағында"],
            "correctAnswer": "Сол жақта"
        },
        {
            "question": "Қандай элемент газ күйінде болады және жиі кездеседі?",
            "options": ["Көміртек", "Азот", "Сутегі", "Хлор"],
            "correctAnswer": "Азот"
        },
        {
            "question": "Периодтық кестеде дәлелденген ең ауыр элемент қайсы?",
            "options": ["Уран", "Плутоний", "Оганесон", "Литий"],
            "correctAnswer": "Оганесон"
        },
        {
            "question": "Аметалдардың қайсысы электронды беруге бейім емес?",
            "options": ["Фтор", "Бром", "Йод", "Неон"],
            "correctAnswer": "Неон"
        }
    ]
    
};



export {
    chapter2
}