const chapter2 = {
    id: 2,
    name: "Периодтық Кесте және Элементтердің Қасиеттері",
    heading: {
        title: "Периодтық Кесте және Элементтердің Қасиеттері",
        text: "Элементтердің физикалық және химиялық қасиеттерін үйреніп, периодтық кестенің құрылымын түсініңіз. Олардың қалай жіктелгенін және элементтер арасындағы байланысты зерделеңіз."
    },
    modelViewer: {
        src: "https://www.ptable.com/",
        width: "100%",
        height: "600",
        title: "Interactive Periodic Table"
    },
    textContent: {
        title: "Периодтық Кестенің Қасиеттері",
        text: "Периодтық кесте элементтердің атомдық нөміріне байланысты реттелген. Бұл кестеде элементтер металдар, металлоидтар және аметалдар болып үш топқа бөлінеді. Металдар электр өткізгіштігі және жылу өткізгіштігі жоғары болса, аметалдар бұл қасиеттерге ие емес. Металлоидтар бұл екі топтың аралығында жатады, олардың кейбір қасиеттері металдарға, ал кейбіреулері аметалдарға ұқсас."
    },
    quizData: [
        {
            "question": "Периодтық кестедегі элементтердің ең басты сипаттамасы қандай?",
            "options": ["Атомдық массасы", "Атомдық нөмірі", "Изотоптары", "Атомдық радиусы"],
            "correctAnswer": "Атомдық нөмірі"
        },
        {
            "question": "Металдар периодтық кестеде қай жағында орналасқан?",
            "options": ["Сол жақта", "Оң жақта", "Ортасында", "Жоғарғы жағында"],
            "correctAnswer": "Сол жақта"
        },
        {
            "question": "Қандай элемент газ күйінде болады және жиі кездеседі?",
            "options": ["Көміртек", "Азот", "Сутегі", "Хлор"],
            "correctAnswer": "Азот"
        },
        {
            "question": "Периодтық кестеде дәлелденген ең ауыр элемент қайсы?",
            "options": ["Уран", "Плутоний", "Оганесон", "Литий"],
            "correctAnswer": "Оганесон"
        },
        {
            "question": "Аметалдардың қайсысы электронды беруге бейім емес?",
            "options": ["Фтор", "Бром", "Йод", "Неон"],
            "correctAnswer": "Неон"
        }
    ]
    
};

const chapter3 = 
    {
        "id": 3,
        "name": "Иондық Байланыс",
        "heading": {
            "title": "Иондық Байланыс",
            "text": "Иондық байланыс элементтер арасындағы күшті әрі берік химиялық байланыс түрі. Бұл байланыс метал және аметал арасында орналасқан, мұнда электрондар металдан аметалға толық беріледі."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/build-an-atom/latest/build-an-atom_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Ionic Bonding Model"
        },
        "textContent": {
            "title": "Иондық байланыс туралы түсінік",
            "text": "Иондық байланыс - бұл электрондардың бір элементтен екіншісіне толық берілуі арқылы қалыптасады. Бұл процесс металдың иондары оң заряд алады және аметалдың иондары теріс заряд алады. Нәтижесінде қарсы зарядталған иондар арасында электростатикалық тартылыс пайда болады, бұл заттардың қатты және мөлдір қасиеттеріне әкеледі."
        },
        "quizData": [
            {
                "question": "Иондық байланыс неден пайда болады?",
                "options": ["Протондардың бөлісуі", "Электрондардың толық берілуі", "Нейтрондардың қозғалысы", "Иондардың бөлінуі"],
                "correctAnswer": "Электрондардың толық берілуі"
            },
            {
                "question": "Иондық байланыс қалыптастырғанда, металдар не істейді?",
                "options": ["Электрон алады", "Электрон береді", "Протон алады", "Нейтрон береді"],
                "correctAnswer": "Электрон береді"
            },
            {
                "question": "Келесі элементтердің қайсысы ең бейім иондық байланыс жасайды?",
                "options": ["Көміртек", "Натрий", "Фосфор", "Сутегі"],
                "correctAnswer": "Натрий"
            },
            {
                "question": "Иондық байланыс әдетте қандай температурада берік?",
                "options": ["Төмен температурада", "Жоғары температурада", "Орташа температурада", "Температураның әсері жоқ"],
                "correctAnswer": "Жоғары температурада"
            },
            {
                "question": "Иондық байланыс болған заттардың ерекшелігі неде?",
                "options": ["Жұмсақ және иілгіш", "Қатты және мөлдір", "Балқу температурасы төмен", "Электр өткізгіштігі жоғары"],
                "correctAnswer": "Қатты және мөлдір"
            }
        ]
    }
    

    const chapter4 = {
        "id": 4,
        "name": "Ковалентті Байланыс",
        "heading": {
            "title": "Ковалентті Байланыс",
            "text": "Ковалентті байланыс - бұл бір немесе одан да көп электрондардың екі атом арасында бөлісілуі арқылы қалыптасатын химиялық байланыс. Бұл байланыс аметалдар арасында кеңінен таралған."
        },
        "modelViewer": {
            "src": "https://phet.colorado.edu/sims/html/molecule-shapes/latest/molecule-shapes_en.html",
            "width": "100%",
            "height": "600",
            "title": "Interactive Covalent Bonding Model"
        },
        "textContent": {
            "title": "Ковалентті Байланыс Негіздері",
            "text": "Ковалентті байланыс қалыптасқанда, атомдар өздерінің сыртқы электрондарын бөліседі, бұл оларды біріктіретін ортақ электрондық жұптарды түзеді. Бұл түрдегі байланыс молекулалардың тұрақты құрылымын қамтамасыз етеді және көбінесе біркелкі эмес электрондық бөлуішілікті қамтиды."
        },
        "quizData": [
            {
                "question": "Ковалентті байланыс қалай қалыптасады?",
                "options": ["Электрондардың толық берілуі", "Электрондардың бөлісілуі", "Иондардың қозғалысы", "Протондардың алмасуы"],
                "correctAnswer": "Электрондардың бөлісілуі"
            },
            {
                "question": "Ковалентті байланыстың ерекшелігі неде?",
                "options": ["Қатты және мөлдір", "Жұмсақ және иілгіш", "Электр өткізгіштігі жоғары", "Жоғары температурада берік"],
                "correctAnswer": "Жұмсақ және иілгіш"
            },
            {
                "question": "Қандай молекула ковалентті байланыспен құрылады?",
                "options": ["NaCl", "H2O", "NaOH", "CaO"],
                "correctAnswer": "H2O"
            },
            {
                "question": "Ковалентті байланыстағы атомдар не істейді?",
                "options": ["Электрондарды береді", "Электрондарды қабылдайды", "Электрондарды бөліседі", "Протондарды алмасады"],
                "correctAnswer": "Электрондарды бөліседі"
            },
            {
                "question": "Ковалентті байланыс қалыптасқанда неше тұрақтылық күшейеді?",
                "options": ["Иондық тұрақтылық", "Молекулалық тұрақтылық", "Химиялық тұрақтылық", "Атомдық тұрақтылық"],
                "correctAnswer": "Молекулалық тұрақтылық"
            }
        ]
    }

    const chapter5 = {
        "id": 5,
        "name": "Металдық Байланыс",
        "heading": {
            "title": "Металдық Байланыс",
            "text": "Металдық байланыс - бұл металл атомдарының ортақ электрон бұлтын құру арқылы өзара байланысқан күйі. Бұл байланыс түрі металлдардың өзгеше қасиеттерін түсіндіруді қамтамасыз етеді, мысалы, жоғары электр және жылу өткізгіштігі."
        },
        "modelViewer": {
            "src": "https://example.com/interactive-metallic-bonding-model",
            "width": "100%",
            "height": "600",
            "title": "Interactive Metallic Bonding Model"
        },
        "textContent": {
            "title": "Металдық Байланысқа Шолу",
            "text": "Металл атомдарының электрондары 'электрон деңгейінде' бос жүреді, бұл олардың жылжымалы болуына және металдық байланыстың қалыптасуына мүмкіндік береді. Электрондардың бұл ортақ пайдалануы металдардың үздіксіз кристалдық құрылымына әкеледі."
        },
        "quizData": [
            {
                "question": "Металдық байланыс неден құралады?",
                "options": ["Электрондардың толық берілуі", "Электрондардың бөлісілуі", "Бос жүретін электрондар", "Протондардың алмасуы"],
                "correctAnswer": "Бос жүретін электрондар"
            },
            {
                "question": "Металдардың жоғары электр өткізгіштігінің себебі неде?",
                "options": ["Протондардың көптігі", "Электрондардың жоғары мобильдігі", "Нейтрондардың стабильдігі", "Иондардың стабильдігі"],
                "correctAnswer": "Электрондардың жоғары мобильдігі"
            },
            {
                "question": "Қандай металл молекулалардың арасындағы металдық байланыстар ең берік?",
                "options": ["Алтын", "Күміс", "Темір", "Свинец"],
                "correctAnswer": "Темір"
            },
            {
                "question": "Металдық байланыс қандай қасиетке әкеледі?",
                "options": ["Балқымаға қарсылық", "Қаттылық", "Магнетизм", "Дуктильдік"],
                "correctAnswer": "Дуктильдік"
            },
            {
                "question": "Металл кристалдарының құрылымы қалай аталады?",
                "options": ["Базалық кристалдық құрылым", "Молекулалық құрылым", "Аморфты құрылым", "Центрленген куб"],
                "correctAnswer": "Центрленген куб"
            }
        ]
    }
    

    const chapters = [
        null,
        chapter2,
        chapter3,
        chapter4,
        chapter5
    ]
    
export {
    chapters
}